hammerlink/atdf2svd/tests/data/atxmega128a1.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Atmel</vendor>
  <name>ATxmega128A1</name>
  <version>1.0</version>
  <description>No description available.</description>
  <cpu>
    <name>other</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>8</width>
  <size>0x8</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000FF</resetMask>
  <peripherals>
    <peripheral>
      <name>ACA</name>
      <description>Analog Comparator</description>
      <baseAddress>0x00000380</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AC0CTRL</name>
          <description>Analog Comparator 0 Control</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HYSMODE</name>
              <description>Hysteresis Mode</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMALL</name>
                  <description>Small hysteresis</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LARGE</name>
                  <description>Large hysteresis</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSMODE</name>
              <description>High-speed Mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTLVL</name>
              <description>Interrupt Level</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE</name>
              <description>Interrupt Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Interrupt on both edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Interrupt on falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Interrupt on rising edge</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AC0MUXCTRL</name>
          <description>Analog Comparator 0 MUX Control</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXNEG</name>
              <description>MUX Negative Input</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>Pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>Pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>Pin 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN5</name>
                  <description>Pin 5</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN7</name>
                  <description>Pin 7</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDGAP</name>
                  <description>Bandgap Reference</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALER</name>
                  <description>Internal voltage scaler</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>MUX Positive Input</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>Pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>Pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>Pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>Pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN4</name>
                  <description>Pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN5</name>
                  <description>Pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN6</name>
                  <description>Pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AC1CTRL</name>
          <description>Analog Comparator 1 Control</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HYSMODE</name>
              <description>Hysteresis Mode</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMALL</name>
                  <description>Small hysteresis</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LARGE</name>
                  <description>Large hysteresis</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSMODE</name>
              <description>High-speed Mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTLVL</name>
              <description>Interrupt Level</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE</name>
              <description>Interrupt Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Interrupt on both edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Interrupt on falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Interrupt on rising edge</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AC1MUXCTRL</name>
          <description>Analog Comparator 1 MUX Control</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXNEG</name>
              <description>MUX Negative Input</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>Pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>Pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>Pin 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN5</name>
                  <description>Pin 5</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN7</name>
                  <description>Pin 7</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDGAP</name>
                  <description>Bandgap Reference</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALER</name>
                  <description>Internal voltage scaler</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>MUX Positive Input</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>Pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>Pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>Pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>Pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN4</name>
                  <description>Pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN5</name>
                  <description>Pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN6</name>
                  <description>Pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AC0OUT</name>
              <description>Analog Comparator 0 Output Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control Register B</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCALEFAC</name>
              <description>VCC Voltage Scaler Factor</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AC0IF</name>
              <description>Analog Comparator 0 Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AC1IF</name>
              <description>Analog Comparator 1 Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WIF</name>
              <description>Window Mode Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AC0STATE</name>
              <description>Analog Comparator 0 State</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AC1STATE</name>
              <description>Analog Comparator 1 State</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WSTATE</name>
              <description>Window Mode State</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABOVE</name>
                  <description>Signal above window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIDE</name>
                  <description>Signal inside window</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BELOW</name>
                  <description>Signal below window</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
