hammerlink/atdf2svd/tests/data/atxmega128a1.svd
          <register>
            <name>MUXCTRL</name>
            <description>MUX Control</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUXNEG</name>
                <description>Negative Input Select</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN0</name>
                    <description>Input pin 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN4</name>
                    <description>Input pin 4</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN1</name>
                    <description>Input pin 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN5</name>
                    <description>Input pin 5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN2</name>
                    <description>Input pin 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN6</name>
                    <description>Input pin 6</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN3</name>
                    <description>Input pin 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN7</name>
                    <description>Input pin 7</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXNEGH</name>
                <description>MUX selection on Negative ADC Input Gain on 4 MSB pins</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN4</name>
                    <description>Input pin 4</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN5</name>
                    <description>Input pin 5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN6</name>
                    <description>Input pin 6</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN7</name>
                    <description>Input pin 7</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXNEGL</name>
                <description>MUX selection on Negative ADC Input Gain on 4 LSB pins</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN0</name>
                    <description>Input pin 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN1</name>
                    <description>Input pin 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN2</name>
                    <description>Input pin 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN3</name>
                    <description>Input pin 3</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXINT</name>
                <description>Internal Input Select</description>
                <bitRange>[6:3]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TEMP</name>
                    <description>Temperature Reference</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BANDGAP</name>
                    <description>Bandgap Reference</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SCALEDVCC</name>
                    <description>1/10 scaled VCC</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DAC</name>
                    <description>DAC output</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXPOS</name>
                <description>Positive Input Select</description>
                <bitRange>[6:3]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN0</name>
                    <description>Input pin 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN1</name>
                    <description>Input pin 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN2</name>
                    <description>Input pin 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN3</name>
                    <description>Input pin 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN4</name>
                    <description>Input pin 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN5</name>
                    <description>Input pin 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN6</name>
                    <description>Input pin 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN7</name>
                    <description>Input pin 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RES</name>
            <description>Channel Result</description>
            <addressOffset>0x4</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>65535</maximum>
              </range>
            </writeConstraint>
          </register>
        </cluster>
