hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADCB</name>
      <description>Analog/Digital Converter</description>
      <baseAddress>0x00000240</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CAL</name>
          <description>Calibration Value</description>
          <addressOffset>0xC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CH0RES</name>
          <description>Channel 0 Result</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CH1RES</name>
          <description>Channel 1 Result</description>
          <addressOffset>0x12</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CH2RES</name>
          <description>Channel 2 Result</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CH3RES</name>
          <description>Channel 3 Result</description>
          <addressOffset>0x16</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CMP</name>
          <description>Compare Value</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLUSH</name>
              <description>Flush Pipeline</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0START</name>
              <description>Channel 0 Start Conversion</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1START</name>
              <description>Channel 1 Start Conversion</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2START</name>
              <description>Channel 2 Start Conversion</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3START</name>
              <description>Channel 3 Start Conversion</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA Selection</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Combined DMA request OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH01</name>
                  <description>ADC Channel 0 or 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH012</name>
                  <description>ADC Channel 0 or 1 or 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0123</name>
                  <description>ADC Channel 0 or 1 or 2 or 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESOLUTION</name>
              <description>Result Resolution</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>12BIT</name>
                  <description>12-bit right-adjusted result</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>8-bit right-adjusted result</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEFT12BIT</name>
                  <description>12-bit left-adjusted result</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free Running Mode Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CONMODE</name>
              <description>Conversion Mode</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVACT</name>
              <description>Event Action Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No event action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>First event triggers channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH01</name>
                  <description>First two events trigger channel 0,1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH012</name>
                  <description>First three events trigger channel 0,1,2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0123</name>
                  <description>Events trigger channel 0,1,2,3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEEP</name>
                  <description>First event triggers sweep</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSWEEP</name>
                  <description>The ADC is flushed and restarted for accurate timing</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVSEL</name>
              <description>Event Input Select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0123</name>
                  <description>Event Channel 0,1,2,3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1234</name>
                  <description>Event Channel 1,2,3,4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2345</name>
                  <description>Event Channel 2,3,4,5</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3456</name>
                  <description>Event Channel 3,4,5,6</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4567</name>
                  <description>Event Channel 4,5,6,7</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>567</name>
                  <description>Event Channel 5,6,7</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>67</name>
                  <description>Event Channel 6,7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Event Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWEEP</name>
              <description>Channel Sweep Selection</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>ADC Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>ADC Channel 0,1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>012</name>
                  <description>ADC Channel 0,1,2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0123</name>
                  <description>ADC Channel 0,1,2,3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0IF</name>
              <description>Channel 0 Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1IF</name>
              <description>Channel 1 Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2IF</name>
              <description>Channel 2 Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3IF</name>
              <description>Channel 3 Interrupt Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESCALER</name>
          <description>Clock Prescaler</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>Clock Prescaler Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide clock by 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide clock by 8</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide clock by 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide clock by 32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide clock by 64</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide clock by 128</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Divide clock by 256</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>Divide clock by 512</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REFCTRL</name>
          <description>Reference Control</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMPREF</name>
              <description>Temperature Reference Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BANDGAP</name>
              <description>Bandgap enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Reference Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT1V</name>
                  <description>Internal 1V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTVCC</name>
                  <description>Internal VCC / 1.6V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFA</name>
                  <description>External reference on PORT A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFB</name>
                  <description>External reference on PORT B</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary register</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <cluster>
          <name>CH0</name>
          <description>ADC Channel</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>INPUTMODE</name>
                <description>Input Mode Select</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERNAL</name>
                    <description>Internal inputs, no gain</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SINGLEENDED</name>
                    <description>Single-ended input, no gain</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIFF</name>
                    <description>Differential input, no gain</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIFFWGAIN</name>
                    <description>Differential input, with gain</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GAINFAC</name>
                <description>Gain Factor</description>
                <bitRange>[4:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1X</name>
                    <description>1x gain</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2X</name>
                    <description>2x gain</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4X</name>
                    <description>4x gain</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8X</name>
                    <description>8x gain</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16X</name>
                    <description>16x gain</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32X</name>
                    <description>32x gain</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64X</name>
                    <description>64x gain</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIV2</name>
                    <description>x/2 gain</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>START</name>
                <description>Channel Start Conversion</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
