hammerlink/atdf2svd/tests/data/atxmega128a1.svd
          <register>
            <name>INTCTRL</name>
            <description>Channel Interrupt Control</description>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>INTLVL</name>
                <description>Interrupt Level</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTMODE</name>
                <description>Interrupt Mode</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>COMPLETE</name>
                    <description>Interrupt on conversion complete</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BELOW</name>
                    <description>Interrupt on result below compare value</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ABOVE</name>
                    <description>Interrupt on result above compare value</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFLAGS</name>
            <description>Interrupt Flags</description>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIF</name>
                <description>Channel Interrupt Flag</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MUXCTRL</name>
            <description>MUX Control</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUXNEG</name>
                <description>Negative Input Select</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN0</name>
                    <description>Input pin 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN4</name>
                    <description>Input pin 4</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN1</name>
                    <description>Input pin 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN5</name>
                    <description>Input pin 5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN2</name>
                    <description>Input pin 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN6</name>
                    <description>Input pin 6</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN3</name>
                    <description>Input pin 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN7</name>
                    <description>Input pin 7</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXNEGH</name>
                <description>MUX selection on Negative ADC Input Gain on 4 MSB pins</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN4</name>
                    <description>Input pin 4</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN5</name>
                    <description>Input pin 5</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN6</name>
                    <description>Input pin 6</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN7</name>
                    <description>Input pin 7</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXNEGL</name>
                <description>MUX selection on Negative ADC Input Gain on 4 LSB pins</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN0</name>
                    <description>Input pin 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN1</name>
                    <description>Input pin 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN2</name>
                    <description>Input pin 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN3</name>
                    <description>Input pin 3</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXINT</name>
                <description>Internal Input Select</description>
                <bitRange>[6:3]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TEMP</name>
                    <description>Temperature Reference</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BANDGAP</name>
                    <description>Bandgap Reference</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SCALEDVCC</name>
                    <description>1/10 scaled VCC</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DAC</name>
                    <description>DAC output</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MUXPOS</name>
                <description>Positive Input Select</description>
                <bitRange>[6:3]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PIN0</name>
                    <description>Input pin 0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN1</name>
                    <description>Input pin 1</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN2</name>
                    <description>Input pin 2</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN3</name>
                    <description>Input pin 3</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN4</name>
                    <description>Input pin 4</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN5</name>
                    <description>Input pin 5</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN6</name>
                    <description>Input pin 6</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIN7</name>
                    <description>Input pin 7</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RES</name>
            <description>Channel Result</description>
            <addressOffset>0x4</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>65535</maximum>
              </range>
            </writeConstraint>
          </register>
        </cluster>
        <cluster>
          <name>CH1</name>
          <description>ADC Channel</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>INPUTMODE</name>
                <description>Input Mode Select</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INTERNAL</name>
                    <description>Internal inputs, no gain</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SINGLEENDED</name>
                    <description>Single-ended input, no gain</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIFF</name>
                    <description>Differential input, no gain</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIFFWGAIN</name>
                    <description>Differential input, with gain</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GAINFAC</name>
                <description>Gain Factor</description>
                <bitRange>[4:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1X</name>
                    <description>1x gain</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2X</name>
                    <description>2x gain</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4X</name>
                    <description>4x gain</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8X</name>
                    <description>8x gain</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16X</name>
                    <description>16x gain</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32X</name>
                    <description>32x gain</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64X</name>
                    <description>64x gain</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DIV2</name>
                    <description>x/2 gain</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>START</name>
                <description>Channel Start Conversion</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTCTRL</name>
            <description>Channel Interrupt Control</description>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>INTLVL</name>
                <description>Interrupt Level</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INTMODE</name>
                <description>Interrupt Mode</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>COMPLETE</name>
                    <description>Interrupt on conversion complete</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BELOW</name>
                    <description>Interrupt on result below compare value</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ABOVE</name>
                    <description>Interrupt on result above compare value</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTFLAGS</name>
            <description>Interrupt Flags</description>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CHIF</name>
                <description>Channel Interrupt Flag</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
