hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLK</name>
      <description>Clock System</description>
      <baseAddress>0x00000040</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCLKSEL</name>
              <description>System Clock Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC2M</name>
                  <description>Internal 2MHz RC Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC32M</name>
                  <description>Internal 32MHz RC Oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC32K</name>
                  <description>Internal 32kHz RC Oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC</name>
                  <description>External Crystal Oscillator or Clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>Phase Locked Loop</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Clock System Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSCTRL</name>
          <description>Prescaler Control Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSBCDIV</name>
              <description>Prescaler B and C Division factor</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_1</name>
                  <description>Divide B by 1 and C by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_2</name>
                  <description>Divide B by 1 and C by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_1</name>
                  <description>Divide B by 4 and C by 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_2</name>
                  <description>Divide B by 2 and C by 2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSADIV</name>
              <description>Prescaler A Division Factor</description>
              <bitRange>[6:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Divide by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>Divide by 8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>Divide by 16</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>Divide by 32</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>Divide by 64</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>Divide by 128</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>Divide by 256</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>Divide by 512</description>
                  <value>17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTRL</name>
          <description>RTC Control Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RTCEN</name>
              <description>RTC Clock Source Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSRC</name>
              <description>RTC Clock Source</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>1kHz from internal 32kHz ULP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC</name>
                  <description>1kHz from 32kHz crystal oscillator on TOSC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSC</name>
                  <description>1kHz from internal 32kHz RC oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOSC32</name>
                  <description>32kHz from 32kHz crystal oscillator on TOSC</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
