hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DACB</name>
      <description>Digital/Analog Converter</description>
      <baseAddress>0x00000320</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CH0DATA</name>
          <description>Channel 0 Data</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CH1DATA</name>
          <description>Channel 1 Data</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMODE</name>
              <description>Low Power Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0EN</name>
              <description>Channel 0 Output Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1EN</name>
              <description>Channel 1 Output Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IDOEN</name>
              <description>Internal Output Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0TRIG</name>
              <description>Channel 0 Event Trig Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1TRIG</name>
              <description>Channel 1 Event Trig Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Channel Select</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single channel operation (Channel A only)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL</name>
                  <description>Dual channel operation (S/H on both channels)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control Register C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEFTADJ</name>
              <description>Left-adjust Result</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Reference Select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT1V</name>
                  <description>Internal 1V </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVCC</name>
                  <description>Analog supply voltage</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFA</name>
                  <description>External reference on AREF on PORTA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFB</name>
                  <description>External reference on AREF on PORTB</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Input Control</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVSEL</name>
              <description>Event Input Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Event Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Event Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Event Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Event Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Event Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Event Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Event Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Event Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINCAL</name>
          <description>Gain Calibration</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GAINCAL</name>
              <description>Gain Calibration</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETCAL</name>
          <description>Offset Calibration</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OFFSETCAL</name>
              <description>Offset Calibration</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0DRE</name>
              <description>Channel 0 Data Register Empty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DRE</name>
              <description>Channel 1 Data Register Empty</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMCTRL</name>
          <description>Timing Control</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFRESH</name>
              <description>Refresh Timing Control</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 CLK</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 CLK</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024CLK</name>
                  <description>1024 CLK</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048CLK</name>
                  <description>2048 CLK</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096CLK</name>
                  <description>4096 CLK</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192CLK</name>
                  <description>8192 CLK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16384CLK</name>
                  <description>16384 CLK</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768CLK</name>
                  <description>32768 CLK</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>65536CLK</name>
                  <description>65536 CLK</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Auto refresh OFF</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONINTVAL</name>
              <description>Conversion Intercal</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1CLK</name>
                  <description>1 CLK / 2 CLK in S/H mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CLK</name>
                  <description>2 CLK / 3 CLK in S/H mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CLK</name>
                  <description>4 CLK / 6 CLK in S/H mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 CLK / 12 CLK in S/H mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 CLK / 24 CLK in S/H mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 CLK / 48 CLK in S/H mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 CLK / 96 CLK in S/H mode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 CLK / 192 CLK in S/H mode</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
