hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA Controller</description>
      <baseAddress>0x00000100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIMODE</name>
              <description>Channel Priority Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RR0123</name>
                  <description>Round Robin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0RR123</name>
                  <description>Channel 0 &gt; Round Robin on channel 1/2/3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH01RR23</name>
                  <description>Channel 0 &gt; channel 1 &gt; Round Robin on channel 2/3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0123</name>
                  <description>Channel 0 &gt; channel 1 &gt; channel 2 &gt; channel 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBUFMODE</name>
              <description>Double Buffering Mode</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Double buffering disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH01</name>
                  <description>Double buffering enabled on channel 0/1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH23</name>
                  <description>Double buffering enabled on channel 2/3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH01CH23</name>
                  <description>Double buffering enabled on ch. 0/1 and ch. 2/3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>Software Reset</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Transfer Interrupt Status</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0TRNIF</name>
              <description>Channel 0 Transaction Complete Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1TRNIF</name>
              <description>Channel 1 Transaction Complete Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2TRNIF</name>
              <description>Channel 2 Transaction Complete Interrupt Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3TRNIF</name>
              <description>Channel 3 Transaction Complete Interrupt Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ERRIF</name>
              <description>Channel 0 Block Transfer Error Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ERRIF</name>
              <description>Channel 1 Block Transfer Error Interrupt Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2ERRIF</name>
              <description>Channel 2 Block Transfer Error Interrupt Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3ERRIF</name>
              <description>Channel 3 Block Transfer Error Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CH0PEND</name>
              <description>Channel 0 Block Transfer Pending</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1PEND</name>
              <description>Channel 1 Block Transfer Pending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2PEND</name>
              <description>Channel 2 Block Transfer Pending</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3PEND</name>
              <description>Channel 3 Block Transfer Pending</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0BUSY</name>
              <description>Channel 0 Block Transfer Busy</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1BUSY</name>
              <description>Channel 1 Block Transfer Busy</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2BUSY</name>
              <description>Channel 2 Block Transfer Busy</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3BUSY</name>
              <description>Channel 3 Block Transfer Busy</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary Register For 16/24-bit Access</description>
          <addressOffset>0x6</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <cluster>
          <name>CH0</name>
          <description>DMA Channel</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>ADDRCTRL</name>
            <description>Address Control</description>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>DESTDIR</name>
                <description>Channel Destination Address Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FIXED</name>
                    <description>Fixed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INC</name>
                    <description>Increment</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEC</name>
                    <description>Decrement</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DESTRELOAD</name>
                <description>Channel Destination Address Reload</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>No reload</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BLOCK</name>
                    <description>Reload at end of block</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BURST</name>
                    <description>Reload at end of burst</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRANSACTION</name>
                    <description>Reload at end of transaction</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRCDIR</name>
                <description>Channel Source Address Mode</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FIXED</name>
                    <description>Fixed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INC</name>
                    <description>Increment</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DEC</name>
                    <description>Decrement</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRCRELOAD</name>
                <description>Channel Source Address Reload</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>No reload</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BLOCK</name>
                    <description>Reload at end of block</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BURST</name>
                    <description>Reload at end of burst</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRANSACTION</name>
                    <description>Reload at end of transaction</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLA</name>
            <description>Channel Control</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>BURSTLEN</name>
                <description>Channel Transfer Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1BYTE</name>
                    <description>1-byte burst mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2BYTE</name>
                    <description>2-byte burst mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4BYTE</name>
                    <description>4-byte burst mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BYTE</name>
                    <description>8-byte burst mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SINGLE</name>
                <description>Channel Single Shot Data Transfer</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TRFREQ</name>
                <description>Channel Transfer Request</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REPEAT</name>
                <description>Channel Repeat Mode</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESET</name>
                <description>Channel Software Reset</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Channel Enable</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLB</name>
            <description>Channel Control</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>TRNINTLVL</name>
                <description>Transaction Complete Interrupt Level</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRINTLVL</name>
                <description>Transfer Error Interrupt Level</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRNIF</name>
                <description>Transaction Complete Interrupt Flag</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ERRIF</name>
                <description>Block Transfer Error Interrupt Flag</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHPEND</name>
                <description>Block Transfer Pending</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHBUSY</name>
                <description>Block Transfer Busy</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DESTADDR0</name>
            <description>Channel Destination Address 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>DESTADDR1</name>
            <description>Channel Destination Address 1</description>
            <addressOffset>0xD</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>DESTADDR2</name>
            <description>Channel Destination Address 2</description>
            <addressOffset>0xE</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>REPCNT</name>
            <description>Channel Repeat Count</description>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
