hammerlink/atdf2svd/tests/data/atxmega128a1.svd
          <register>
            <name>CTRLA</name>
            <description>Channel Control</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>BURSTLEN</name>
                <description>Channel Transfer Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1BYTE</name>
                    <description>1-byte burst mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2BYTE</name>
                    <description>2-byte burst mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4BYTE</name>
                    <description>4-byte burst mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8BYTE</name>
                    <description>8-byte burst mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SINGLE</name>
                <description>Channel Single Shot Data Transfer</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TRFREQ</name>
                <description>Channel Transfer Request</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REPEAT</name>
                <description>Channel Repeat Mode</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESET</name>
                <description>Channel Software Reset</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Channel Enable</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLB</name>
            <description>Channel Control</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>TRNINTLVL</name>
                <description>Transaction Complete Interrupt Level</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ERRINTLVL</name>
                <description>Transfer Error Interrupt Level</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRNIF</name>
                <description>Transaction Complete Interrupt Flag</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ERRIF</name>
                <description>Block Transfer Error Interrupt Flag</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHPEND</name>
                <description>Block Transfer Pending</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHBUSY</name>
                <description>Block Transfer Busy</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DESTADDR0</name>
            <description>Channel Destination Address 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>DESTADDR1</name>
            <description>Channel Destination Address 1</description>
            <addressOffset>0xD</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>DESTADDR2</name>
            <description>Channel Destination Address 2</description>
            <addressOffset>0xE</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>REPCNT</name>
            <description>Channel Repeat Count</description>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>SRCADDR0</name>
            <description>Channel Source Address 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>SRCADDR1</name>
            <description>Channel Source Address 1</description>
            <addressOffset>0x9</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>SRCADDR2</name>
            <description>Channel Source Address 2</description>
            <addressOffset>0xA</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>TRFCNT</name>
            <description>Channel Block Transfer Count</description>
            <addressOffset>0x4</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>65535</maximum>
              </range>
            </writeConstraint>
          </register>
