hammerlink/atdf2svd/tests/data/atxmega128a1.svd
          <register>
            <name>TRIGSRC</name>
            <description>Channel Trigger Source</description>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>TRIGSRC</name>
                <description>Channel Trigger Source</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Off software triggers only</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVSYS_CH0</name>
                    <description>Event System Channel 0</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVSYS_CH1</name>
                    <description>Event System Channel 1</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EVSYS_CH2</name>
                    <description>Event System Channel 2</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCA_CH0</name>
                    <description>ADCA Channel 0</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCA_CH1</name>
                    <description>ADCA Channel 1</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCA_CH2</name>
                    <description>ADCA Channel 2</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCA_CH3</name>
                    <description>ADCA Channel 3</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCA_CH4</name>
                    <description>ADCA Channel 0,1,2,3 combined</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACA_CH0</name>
                    <description>DACA Channel 0</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACA_CH1</name>
                    <description>DACA Channel 1</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCB_CH0</name>
                    <description>ADCB Channel 0</description>
                    <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCB_CH1</name>
                    <description>ADCB Channel 1</description>
                    <value>33</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCB_CH2</name>
                    <description>ADCB Channel 2</description>
                    <value>34</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCB_CH3</name>
                    <description>ADCB Channel 3</description>
                    <value>35</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADCB_CH4</name>
                    <description>ADCB Channel 0,1,2,3 combined</description>
                    <value>36</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACB_CH0</name>
                    <description>DACB Channel 0</description>
                    <value>37</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DACB_CH1</name>
                    <description>DACB Channel 1</description>
                    <value>38</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC0_OVF</name>
                    <description>Timer/Counter C0 Overflow</description>
                    <value>64</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC0_ERR</name>
                    <description>Timer/Counter C0 Error</description>
                    <value>65</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC0_CCA</name>
                    <description>Timer/Counter C0 Compare or Capture A</description>
                    <value>66</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC0_CCB</name>
                    <description>Timer/Counter C0 Compare or Capture B</description>
                    <value>67</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC0_CCC</name>
                    <description>Timer/Counter C0 Compare or Capture C</description>
                    <value>68</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC0_CCD</name>
                    <description>Timer/Counter C0 Compare or Capture D</description>
                    <value>69</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC1_OVF</name>
                    <description>Timer/Counter C1 Overflow</description>
                    <value>70</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC1_ERR</name>
                    <description>Timer/Counter C1 Error</description>
                    <value>71</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC1_CCA</name>
                    <description>Timer/Counter C1 Compare or Capture A</description>
                    <value>72</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCC1_CCB</name>
                    <description>Timer/Counter C1 Compare or Capture B</description>
                    <value>73</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPIC</name>
                    <description>SPI C Transfer Complete</description>
                    <value>74</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTC0_RXC</name>
                    <description>USART C0 Receive Complete</description>
                    <value>75</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTC0_DRE</name>
                    <description>USART C0 Data Register Empty</description>
                    <value>76</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTC1_RXC</name>
                    <description>USART C1 Receive Complete</description>
                    <value>78</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTC1_DRE</name>
                    <description>USART C1 Data Register Empty</description>
                    <value>79</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD0_OVF</name>
                    <description>Timer/Counter D0 Overflow</description>
                    <value>96</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD0_ERR</name>
                    <description>Timer/Counter D0 Error</description>
                    <value>97</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD0_CCA</name>
                    <description>Timer/Counter D0 Compare or Capture A</description>
                    <value>98</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD0_CCB</name>
                    <description>Timer/Counter D0 Compare or Capture B</description>
                    <value>99</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD0_CCC</name>
                    <description>Timer/Counter D0 Compare or Capture C</description>
                    <value>100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD0_CCD</name>
                    <description>Timer/Counter D0 Compare or Capture D</description>
                    <value>101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD1_OVF</name>
                    <description>Timer/Counter D1 Overflow</description>
                    <value>102</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD1_ERR</name>
                    <description>Timer/Counter D1 Error</description>
                    <value>103</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD1_CCA</name>
                    <description>Timer/Counter D1 Compare or Capture A</description>
                    <value>104</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCD1_CCB</name>
                    <description>Timer/Counter D1 Compare or Capture B</description>
                    <value>105</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPID</name>
                    <description>SPI D Transfer Complete</description>
                    <value>106</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTD0_RXC</name>
                    <description>USART D0 Receive Complete</description>
                    <value>107</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTD0_DRE</name>
                    <description>USART D0 Data Register Empty</description>
                    <value>108</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTD1_RXC</name>
                    <description>USART D1 Receive Complete</description>
                    <value>110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTD1_DRE</name>
                    <description>USART D1 Data Register Empty</description>
                    <value>111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE0_OVF</name>
                    <description>Timer/Counter E0 Overflow</description>
                    <value>128</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE0_ERR</name>
                    <description>Timer/Counter E0 Error</description>
                    <value>129</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE0_CCA</name>
                    <description>Timer/Counter E0 Compare or Capture A</description>
                    <value>130</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE0_CCB</name>
                    <description>Timer/Counter E0 Compare or Capture B</description>
                    <value>131</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE0_CCC</name>
                    <description>Timer/Counter E0 Compare or Capture C</description>
                    <value>132</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE0_CCD</name>
                    <description>Timer/Counter E0 Compare or Capture D</description>
                    <value>133</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE1_OVF</name>
                    <description>Timer/Counter E1 Overflow</description>
                    <value>134</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE1_ERR</name>
                    <description>Timer/Counter E1 Error</description>
                    <value>135</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE1_CCA</name>
                    <description>Timer/Counter E1 Compare or Capture A</description>
                    <value>136</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCE1_CCB</name>
                    <description>Timer/Counter E1 Compare or Capture B</description>
                    <value>137</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPIE</name>
                    <description>SPI E Transfer Complete</description>
                    <value>138</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTE0_RXC</name>
                    <description>USART E0 Receive Complete</description>
                    <value>139</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTE0_DRE</name>
                    <description>USART E0 Data Register Empty</description>
                    <value>140</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTE1_RXC</name>
                    <description>USART E1 Receive Complete</description>
                    <value>142</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTE1_DRE</name>
                    <description>USART E1 Data Register Empty</description>
                    <value>143</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF0_OVF</name>
                    <description>Timer/Counter F0 Overflow</description>
                    <value>160</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF0_ERR</name>
                    <description>Timer/Counter F0 Error</description>
                    <value>161</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF0_CCA</name>
                    <description>Timer/Counter F0 Compare or Capture A</description>
                    <value>162</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF0_CCB</name>
                    <description>Timer/Counter F0 Compare or Capture B</description>
                    <value>163</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF0_CCC</name>
                    <description>Timer/Counter F0 Compare or Capture C</description>
                    <value>164</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF0_CCD</name>
                    <description>Timer/Counter F0 Compare or Capture D</description>
                    <value>165</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF1_OVF</name>
                    <description>Timer/Counter F1 Overflow</description>
                    <value>166</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF1_ERR</name>
                    <description>Timer/Counter F1 Error</description>
                    <value>167</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF1_CCA</name>
                    <description>Timer/Counter F1 Compare or Capture A</description>
                    <value>168</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TCF1_CCB</name>
                    <description>Timer/Counter F1 Compare or Capture B</description>
                    <value>169</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPIF</name>
                    <description>SPI F Transfer Complete</description>
                    <value>170</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTF0_RXC</name>
                    <description>USART F0 Receive Complete</description>
                    <value>171</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTF0_DRE</name>
                    <description>USART F0 Data Register Empty</description>
                    <value>172</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTF1_RXC</name>
                    <description>USART F1 Receive Complete</description>
                    <value>174</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USARTF1_DRE</name>
                    <description>USART F1 Data Register Empty</description>
                    <value>175</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
