hammerlink/atdf2svd/tests/data/atxmega128a1.svd
          <register>
            <name>CTRLA</name>
            <description>Chip Select Control Register A</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>MODE</name>
                <description>Memory Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Chip Select Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SRAM</name>
                    <description>Chip Select in SRAM mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPC</name>
                    <description>Chip Select in SRAM LPC mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDRAM</name>
                    <description>Chip Select in SDRAM mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ASIZE</name>
                <description>Address Size</description>
                <bitRange>[6:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>256B</name>
                    <description>256 bytes</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512B</name>
                    <description>512 bytes</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1KB</name>
                    <description>1K bytes</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2KB</name>
                    <description>2K bytes</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4KB</name>
                    <description>4K bytes</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8KB</name>
                    <description>8K bytes</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16KB</name>
                    <description>16K bytes</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32KB</name>
                    <description>32K bytes</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64KB</name>
                    <description>64K bytes</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128KB</name>
                    <description>128K bytes</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256KB</name>
                    <description>256K bytes</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512KB</name>
                    <description>512K bytes</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1MB</name>
                    <description>1M bytes</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2MB</name>
                    <description>2M bytes</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4MB</name>
                    <description>4M bytes</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8MB</name>
                    <description>8M bytes</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16M</name>
                    <description>16M bytes</description>
                    <value>16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLB</name>
            <description>Chip Select Control Register B</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>SDMODE</name>
                <description>SDRAM Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOAD</name>
                    <description>Load Mode Register command mode</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRWS</name>
                <description>SRAM Wait State Cycles</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0CLK</name>
                    <description>0 cycles</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1CLK</name>
                    <description>1 cycle</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2CLK</name>
                    <description>2 cycles</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3CLK</name>
                    <description>3 cycles</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4CLK</name>
                    <description>4 cycles</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>5CLK</name>
                    <description>5 cycles</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6CLK</name>
                    <description>6 cycles</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>7CLK</name>
                    <description>7 cycles</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDSREN</name>
                <description>SDRAM Self-refresh Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SDINITDONE</name>
                <description>SDRAM Initialization Done</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CS1</name>
          <description>EBI Chip Select Module</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>BASEADDR</name>
            <description>Base Address</description>
            <addressOffset>0x2</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>BASEADDR</name>
                <description>Chip Select Base Address</description>
                <bitRange>[15:4]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>4095</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLA</name>
            <description>Chip Select Control Register A</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>MODE</name>
                <description>Memory Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Chip Select Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SRAM</name>
                    <description>Chip Select in SRAM mode</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPC</name>
                    <description>Chip Select in SRAM LPC mode</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDRAM</name>
                    <description>Chip Select in SDRAM mode</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ASIZE</name>
                <description>Address Size</description>
                <bitRange>[6:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>256B</name>
                    <description>256 bytes</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512B</name>
                    <description>512 bytes</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1KB</name>
                    <description>1K bytes</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2KB</name>
                    <description>2K bytes</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4KB</name>
                    <description>4K bytes</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8KB</name>
                    <description>8K bytes</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16KB</name>
                    <description>16K bytes</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32KB</name>
                    <description>32K bytes</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64KB</name>
                    <description>64K bytes</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128KB</name>
                    <description>128K bytes</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256KB</name>
                    <description>256K bytes</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512KB</name>
                    <description>512K bytes</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1MB</name>
                    <description>1M bytes</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2MB</name>
                    <description>2M bytes</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4MB</name>
                    <description>4M bytes</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>8MB</name>
                    <description>8M bytes</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16M</name>
                    <description>16M bytes</description>
                    <value>16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLB</name>
            <description>Chip Select Control Register B</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>SDMODE</name>
                <description>SDRAM Mode</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Normal mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOAD</name>
                    <description>Load Mode Register command mode</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRWS</name>
                <description>SRAM Wait State Cycles</description>
                <bitRange>[2:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0CLK</name>
                    <description>0 cycles</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1CLK</name>
                    <description>1 cycle</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2CLK</name>
                    <description>2 cycles</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3CLK</name>
                    <description>3 cycles</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4CLK</name>
                    <description>4 cycles</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>5CLK</name>
                    <description>5 cycles</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6CLK</name>
                    <description>6 cycles</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>7CLK</name>
                    <description>7 cycles</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SDSREN</name>
                <description>SDRAM Self-refresh Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SDINITDONE</name>
                <description>SDRAM Initialization Done</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CS2</name>
          <description>EBI Chip Select Module</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>BASEADDR</name>
            <description>Base Address</description>
            <addressOffset>0x2</addressOffset>
            <size>0x10</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>BASEADDR</name>
                <description>Chip Select Base Address</description>
                <bitRange>[15:4]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>4095</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
