hammerlink/atdf2svd/tests/data/atxmega128a1.svd
                  <value>200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_ERR</name>
                  <description>Timer/Counter C1 Error</description>
                  <value>201</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_CCA</name>
                  <description>Timer/Counter C1 Compare or Capture A</description>
                  <value>204</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_CCB</name>
                  <description>Timer/Counter C1 Compare or Capture B</description>
                  <value>205</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_OVF</name>
                  <description>Timer/Counter D0 Overflow</description>
                  <value>208</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_ERR</name>
                  <description>Timer/Counter D0 Error</description>
                  <value>209</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCA</name>
                  <description>Timer/Counter D0 Compare or Capture A</description>
                  <value>212</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCB</name>
                  <description>Timer/Counter D0 Compare or Capture B</description>
                  <value>213</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCC</name>
                  <description>Timer/Counter D0 Compare or Capture C</description>
                  <value>214</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCD</name>
                  <description>Timer/Counter D0 Compare or Capture D</description>
                  <value>215</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_OVF</name>
                  <description>Timer/Counter D1 Overflow</description>
                  <value>216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_ERR</name>
                  <description>Timer/Counter D1 Error</description>
                  <value>217</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_CCA</name>
                  <description>Timer/Counter D1 Compare or Capture A</description>
                  <value>220</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_CCB</name>
                  <description>Timer/Counter D1 Compare or Capture B</description>
                  <value>221</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_OVF</name>
                  <description>Timer/Counter E0 Overflow</description>
                  <value>224</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_ERR</name>
                  <description>Timer/Counter E0 Error</description>
                  <value>225</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCA</name>
                  <description>Timer/Counter E0 Compare or Capture A</description>
                  <value>228</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCB</name>
                  <description>Timer/Counter E0 Compare or Capture B</description>
                  <value>229</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCC</name>
                  <description>Timer/Counter E0 Compare or Capture C</description>
                  <value>230</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCD</name>
                  <description>Timer/Counter E0 Compare or Capture D</description>
                  <value>231</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_OVF</name>
                  <description>Timer/Counter E1 Overflow</description>
                  <value>232</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_ERR</name>
                  <description>Timer/Counter E1 Error</description>
                  <value>233</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_CCA</name>
                  <description>Timer/Counter E1 Compare or Capture A</description>
                  <value>236</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_CCB</name>
                  <description>Timer/Counter E1 Compare or Capture B</description>
                  <value>237</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_OVF</name>
                  <description>Timer/Counter F0 Overflow</description>
                  <value>240</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_ERR</name>
                  <description>Timer/Counter F0 Error</description>
                  <value>241</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCA</name>
                  <description>Timer/Counter F0 Compare or Capture A</description>
                  <value>244</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCB</name>
                  <description>Timer/Counter F0 Compare or Capture B</description>
                  <value>245</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCC</name>
                  <description>Timer/Counter F0 Compare or Capture C</description>
                  <value>246</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCD</name>
                  <description>Timer/Counter F0 Compare or Capture D</description>
                  <value>247</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_OVF</name>
                  <description>Timer/Counter F1 Overflow</description>
                  <value>248</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_ERR</name>
                  <description>Timer/Counter F1 Error</description>
                  <value>249</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_CCA</name>
                  <description>Timer/Counter F1 Compare or Capture A</description>
                  <value>252</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_CCB</name>
                  <description>Timer/Counter F1 Compare or Capture B</description>
                  <value>253</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4CTRL</name>
          <description>Channel 4 Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIGFILT</name>
              <description>Digital Filter</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1SAMPLE</name>
                  <description>1 SAMPLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SAMPLES</name>
                  <description>2 SAMPLES</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3SAMPLES</name>
                  <description>3 SAMPLES</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4SAMPLES</name>
                  <description>4 SAMPLES</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5SAMPLES</name>
                  <description>5 SAMPLES</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6SAMPLES</name>
                  <description>6 SAMPLES</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7SAMPLES</name>
                  <description>7 SAMPLES</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8SAMPLES</name>
                  <description>8 SAMPLES</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDEN</name>
              <description>Quadrature Decoder Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QDIEN</name>
              <description>Quadrature Decoder Index Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QDIRM</name>
              <description>Quadrature Decoder Index Recognition Mode</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>QDPH0 = 0, QDPH90 = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>QDPH0 = 0, QDPH90 = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>QDPH0 = 1, QDPH90 = 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>QDPH0 = 1, QDPH90 = 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
