hammerlink/atdf2svd/tests/data/atxmega128a1.svd
                  <value>236</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_CCB</name>
                  <description>Timer/Counter E1 Compare or Capture B</description>
                  <value>237</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_OVF</name>
                  <description>Timer/Counter F0 Overflow</description>
                  <value>240</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_ERR</name>
                  <description>Timer/Counter F0 Error</description>
                  <value>241</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCA</name>
                  <description>Timer/Counter F0 Compare or Capture A</description>
                  <value>244</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCB</name>
                  <description>Timer/Counter F0 Compare or Capture B</description>
                  <value>245</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCC</name>
                  <description>Timer/Counter F0 Compare or Capture C</description>
                  <value>246</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCD</name>
                  <description>Timer/Counter F0 Compare or Capture D</description>
                  <value>247</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_OVF</name>
                  <description>Timer/Counter F1 Overflow</description>
                  <value>248</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_ERR</name>
                  <description>Timer/Counter F1 Error</description>
                  <value>249</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_CCA</name>
                  <description>Timer/Counter F1 Compare or Capture A</description>
                  <value>252</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_CCB</name>
                  <description>Timer/Counter F1 Compare or Capture B</description>
                  <value>253</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5CTRL</name>
          <description>Channel 5 Control Register</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIGFILT</name>
              <description>Digital Filter</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1SAMPLE</name>
                  <description>1 SAMPLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SAMPLES</name>
                  <description>2 SAMPLES</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3SAMPLES</name>
                  <description>3 SAMPLES</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4SAMPLES</name>
                  <description>4 SAMPLES</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5SAMPLES</name>
                  <description>5 SAMPLES</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6SAMPLES</name>
                  <description>6 SAMPLES</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7SAMPLES</name>
                  <description>7 SAMPLES</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8SAMPLES</name>
                  <description>8 SAMPLES</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5MUX</name>
          <description>Event Channel 5 Multiplexer</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHMUX</name>
              <description>Event Channel 5 Multiplexer</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>RTC Overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>RTC Compare Match</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACA_CH0</name>
                  <description>Analog Comparator A Channel 0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACA_CH1</name>
                  <description>Analog Comparator A Channel 1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACA_WIN</name>
                  <description>Analog Comparator A Window</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACB_CH0</name>
                  <description>Analog Comparator B Channel 0</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACB_CH1</name>
                  <description>Analog Comparator B Channel 1</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACB_WIN</name>
                  <description>Analog Comparator B Window</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCA_CH0</name>
                  <description>ADC A Channel 0</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCA_CH1</name>
                  <description>ADC A Channel 1</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCA_CH2</name>
                  <description>ADC A Channel 2</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCA_CH3</name>
                  <description>ADC A Channel 3</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB_CH0</name>
                  <description>ADC B Channel 0</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB_CH1</name>
                  <description>ADC B Channel 1</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB_CH2</name>
                  <description>ADC B Channel 2</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB_CH3</name>
                  <description>ADC B Channel 3</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN0</name>
                  <description>Port A, Pin0</description>
                  <value>80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN1</name>
                  <description>Port A, Pin1</description>
                  <value>81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN2</name>
                  <description>Port A, Pin2</description>
                  <value>82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN3</name>
                  <description>Port A, Pin3</description>
                  <value>83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN4</name>
                  <description>Port A, Pin4</description>
                  <value>84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN5</name>
                  <description>Port A, Pin5</description>
                  <value>85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN6</name>
                  <description>Port A, Pin6</description>
                  <value>86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN7</name>
                  <description>Port A, Pin7</description>
                  <value>87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Port B, Pin0</description>
                  <value>88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Port B, Pin1</description>
                  <value>89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Port B, Pin2</description>
                  <value>90</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Port B, Pin3</description>
                  <value>91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Port B, Pin4</description>
                  <value>92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Port B, Pin5</description>
                  <value>93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Port B, Pin6</description>
                  <value>94</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Port B, Pin7</description>
                  <value>95</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN0</name>
                  <description>Port C, Pin0</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN1</name>
                  <description>Port C, Pin1</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN2</name>
                  <description>Port C, Pin2</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN3</name>
                  <description>Port C, Pin3</description>
                  <value>99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN4</name>
                  <description>Port C, Pin4</description>
                  <value>100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN5</name>
                  <description>Port C, Pin5</description>
                  <value>101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN6</name>
                  <description>Port C, Pin6</description>
                  <value>102</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN7</name>
                  <description>Port C, Pin7</description>
                  <value>103</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN0</name>
                  <description>Port D, Pin0</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN1</name>
                  <description>Port D, Pin1</description>
                  <value>105</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN2</name>
                  <description>Port D, Pin2</description>
                  <value>106</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN3</name>
                  <description>Port D, Pin3</description>
                  <value>107</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN4</name>
                  <description>Port D, Pin4</description>
                  <value>108</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN5</name>
                  <description>Port D, Pin5</description>
                  <value>109</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN6</name>
                  <description>Port D, Pin6</description>
                  <value>110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_PIN7</name>
                  <description>Port D, Pin7</description>
                  <value>111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN0</name>
                  <description>Port E, Pin0</description>
                  <value>112</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN1</name>
                  <description>Port E, Pin1</description>
                  <value>113</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN2</name>
                  <description>Port E, Pin2</description>
                  <value>114</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN3</name>
                  <description>Port E, Pin3</description>
                  <value>115</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN4</name>
                  <description>Port E, Pin4</description>
                  <value>116</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN5</name>
                  <description>Port E, Pin5</description>
                  <value>117</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN6</name>
                  <description>Port E, Pin6</description>
                  <value>118</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE_PIN7</name>
                  <description>Port E, Pin7</description>
                  <value>119</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN0</name>
                  <description>Port F, Pin0</description>
                  <value>120</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN1</name>
                  <description>Port F, Pin1</description>
                  <value>121</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN2</name>
                  <description>Port F, Pin2</description>
                  <value>122</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN3</name>
                  <description>Port F, Pin3</description>
                  <value>123</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN4</name>
                  <description>Port F, Pin4</description>
                  <value>124</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN5</name>
                  <description>Port F, Pin5</description>
                  <value>125</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN6</name>
                  <description>Port F, Pin6</description>
                  <value>126</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_PIN7</name>
                  <description>Port F, Pin7</description>
                  <value>127</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>Prescaler, divide by 1</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>Prescaler, divide by 2</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>Prescaler, divide by 4</description>
                  <value>130</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8</name>
                  <description>Prescaler, divide by 8</description>
                  <value>131</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16</name>
                  <description>Prescaler, divide by 16</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32</name>
                  <description>Prescaler, divide by 32</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_64</name>
                  <description>Prescaler, divide by 64</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_128</name>
                  <description>Prescaler, divide by 128</description>
                  <value>135</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_256</name>
                  <description>Prescaler, divide by 256</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_512</name>
                  <description>Prescaler, divide by 512</description>
                  <value>137</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_1024</name>
                  <description>Prescaler, divide by 1024</description>
                  <value>138</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2048</name>
                  <description>Prescaler, divide by 2048</description>
                  <value>139</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4096</name>
                  <description>Prescaler, divide by 4096</description>
                  <value>140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8192</name>
                  <description>Prescaler, divide by 8192</description>
                  <value>141</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16384</name>
                  <description>Prescaler, divide by 16384</description>
                  <value>142</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32768</name>
                  <description>Prescaler, divide by 32768</description>
                  <value>143</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC0_OVF</name>
                  <description>Timer/Counter C0 Overflow</description>
                  <value>192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC0_ERR</name>
                  <description>Timer/Counter C0 Error</description>
                  <value>193</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC0_CCA</name>
                  <description>Timer/Counter C0 Compare or Capture A</description>
                  <value>196</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC0_CCB</name>
                  <description>Timer/Counter C0 Compare or Capture B</description>
                  <value>197</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC0_CCC</name>
                  <description>Timer/Counter C0 Compare or Capture C</description>
                  <value>198</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC0_CCD</name>
                  <description>Timer/Counter C0 Compare or Capture D</description>
                  <value>199</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_OVF</name>
                  <description>Timer/Counter C1 Overflow</description>
