hammerlink/atdf2svd/tests/data/atxmega128a1.svd
                  <value>200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_ERR</name>
                  <description>Timer/Counter C1 Error</description>
                  <value>201</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_CCA</name>
                  <description>Timer/Counter C1 Compare or Capture A</description>
                  <value>204</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCC1_CCB</name>
                  <description>Timer/Counter C1 Compare or Capture B</description>
                  <value>205</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_OVF</name>
                  <description>Timer/Counter D0 Overflow</description>
                  <value>208</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_ERR</name>
                  <description>Timer/Counter D0 Error</description>
                  <value>209</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCA</name>
                  <description>Timer/Counter D0 Compare or Capture A</description>
                  <value>212</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCB</name>
                  <description>Timer/Counter D0 Compare or Capture B</description>
                  <value>213</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCC</name>
                  <description>Timer/Counter D0 Compare or Capture C</description>
                  <value>214</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CCD</name>
                  <description>Timer/Counter D0 Compare or Capture D</description>
                  <value>215</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_OVF</name>
                  <description>Timer/Counter D1 Overflow</description>
                  <value>216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_ERR</name>
                  <description>Timer/Counter D1 Error</description>
                  <value>217</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_CCA</name>
                  <description>Timer/Counter D1 Compare or Capture A</description>
                  <value>220</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD1_CCB</name>
                  <description>Timer/Counter D1 Compare or Capture B</description>
                  <value>221</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_OVF</name>
                  <description>Timer/Counter E0 Overflow</description>
                  <value>224</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_ERR</name>
                  <description>Timer/Counter E0 Error</description>
                  <value>225</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCA</name>
                  <description>Timer/Counter E0 Compare or Capture A</description>
                  <value>228</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCB</name>
                  <description>Timer/Counter E0 Compare or Capture B</description>
                  <value>229</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCC</name>
                  <description>Timer/Counter E0 Compare or Capture C</description>
                  <value>230</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE0_CCD</name>
                  <description>Timer/Counter E0 Compare or Capture D</description>
                  <value>231</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_OVF</name>
                  <description>Timer/Counter E1 Overflow</description>
                  <value>232</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_ERR</name>
                  <description>Timer/Counter E1 Error</description>
                  <value>233</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_CCA</name>
                  <description>Timer/Counter E1 Compare or Capture A</description>
                  <value>236</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE1_CCB</name>
                  <description>Timer/Counter E1 Compare or Capture B</description>
                  <value>237</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_OVF</name>
                  <description>Timer/Counter F0 Overflow</description>
                  <value>240</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_ERR</name>
                  <description>Timer/Counter F0 Error</description>
                  <value>241</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCA</name>
                  <description>Timer/Counter F0 Compare or Capture A</description>
                  <value>244</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCB</name>
                  <description>Timer/Counter F0 Compare or Capture B</description>
                  <value>245</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCC</name>
                  <description>Timer/Counter F0 Compare or Capture C</description>
                  <value>246</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF0_CCD</name>
                  <description>Timer/Counter F0 Compare or Capture D</description>
                  <value>247</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_OVF</name>
                  <description>Timer/Counter F1 Overflow</description>
                  <value>248</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_ERR</name>
                  <description>Timer/Counter F1 Error</description>
                  <value>249</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_CCA</name>
                  <description>Timer/Counter F1 Compare or Capture A</description>
                  <value>252</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCF1_CCB</name>
                  <description>Timer/Counter F1 Compare or Capture B</description>
                  <value>253</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Event Data</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>STROBE</name>
          <description>Event Strobe</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
