hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HIRESC</name>
      <description>16-bit Timer/Counter With PWM</description>
      <baseAddress>0x00000890</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HREN</name>
              <description>High Resolution Enable</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Fault Protection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC0</name>
                  <description>Enable High Resolution on Timer/Counter 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC1</name>
                  <description>Enable High Resolution on Timer/Counter 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Enable High Resolution both Timer/Counters</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HIRESD</name>
      <description>16-bit Timer/Counter With PWM</description>
      <baseAddress>0x00000990</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HREN</name>
              <description>High Resolution Enable</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Fault Protection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC0</name>
                  <description>Enable High Resolution on Timer/Counter 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC1</name>
                  <description>Enable High Resolution on Timer/Counter 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Enable High Resolution both Timer/Counters</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HIRESE</name>
      <description>16-bit Timer/Counter With PWM</description>
      <baseAddress>0x00000A90</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HREN</name>
              <description>High Resolution Enable</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Fault Protection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC0</name>
                  <description>Enable High Resolution on Timer/Counter 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC1</name>
                  <description>Enable High Resolution on Timer/Counter 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Enable High Resolution both Timer/Counters</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HIRESF</name>
      <description>16-bit Timer/Counter With PWM</description>
      <baseAddress>0x00000B90</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HREN</name>
              <description>High Resolution Enable</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Fault Protection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC0</name>
                  <description>Enable High Resolution on Timer/Counter 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC1</name>
                  <description>Enable High Resolution on Timer/Counter 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Enable High Resolution both Timer/Counters</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
