hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IRCOM</name>
      <description>IR Communication Module</description>
      <baseAddress>0x000008F8</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVSEL</name>
              <description>Event Channel Select</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>Event Channel 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Event Channel 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>Event Channel 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>Event Channel 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>Event Channel 4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>Event Channel 5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>Event Channel 6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Event Channel 7</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPLCTRL</name>
          <description>IrDA Receiver Pulse Length Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TXPLCTRL</name>
          <description>IrDA Transmitter Pulse Length Control Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCKBIT</name>
      <description>Non Volatile Memory Controller</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOCKBITS</name>
          <description>Lock Bits</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LB</name>
              <description>Lock Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLBAT</name>
              <description>Boot Lock Bits - Application Table</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RLOCK</name>
                  <description>Read not allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLBA</name>
              <description>Boot Lock Bits - Application Section</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RLOCK</name>
                  <description>Read not allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLBB</name>
              <description>Boot Lock Bits - Boot Section</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RLOCK</name>
                  <description>Read not allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
