hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MCU</name>
      <description>MCU Control</description>
      <baseAddress>0x00000090</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AWEXLOCK</name>
          <description>AWEX Lock</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWEXCLOCK</name>
              <description>AWeX on T/C C0 Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWEXELOCK</name>
              <description>AWeX on T/C E0 Lock</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID0</name>
          <description>Device ID byte 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVID1</name>
          <description>Device ID byte 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVID2</name>
          <description>Device ID byte 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EVSYSLOCK</name>
          <description>Event System Lock</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVSYS0LOCK</name>
              <description>Event Channel 0-3 Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVSYS1LOCK</name>
              <description>Event Channel 4-7 Lock</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGUID</name>
          <description>JTAG User ID</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTAGD</name>
              <description>JTAG Disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REVID</name>
          <description>Revision ID</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVM</name>
      <description>Non Volatile Memory Controller</description>
      <baseAddress>0x000001C0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADDR0</name>
          <description>Address Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADDR1</name>
          <description>Address Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADDR2</name>
          <description>Address Register 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CMD</name>
          <description>Command</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OPERATION</name>
                  <description>Noop/Ordinary LPM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_USER_SIG_ROW</name>
                  <description>Read user signature row</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_CALIB_ROW</name>
                  <description>Read calibration row</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_EEPROM</name>
                  <description>Read EEPROM</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_FUSES</name>
                  <description>Read fuse byte</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_LOCK_BITS</name>
                  <description>Write lock bits</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_USER_SIG_ROW</name>
                  <description>Erase user signature row</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_USER_SIG_ROW</name>
                  <description>Write user signature row</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_APP</name>
                  <description>Erase Application Section</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_APP_PAGE</name>
                  <description>Erase Application Section page</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_FLASH_BUFFER</name>
                  <description>Load Flash page buffer</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_APP_PAGE</name>
                  <description>Write Application Section page</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_WRITE_APP_PAGE</name>
                  <description>Erase-and-write Application Section page</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_FLASH_BUFFER</name>
                  <description>Erase/flush Flash page buffer</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_BOOT_PAGE</name>
                  <description>Erase Boot Section page</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_FLASH_PAGE</name>
                  <description>Erase Flash Page</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_BOOT_PAGE</name>
                  <description>Write Boot Section page</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_WRITE_BOOT_PAGE</name>
                  <description>Erase-and-write Boot Section page</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_FLASH_PAGE</name>
                  <description>Write Flash Page</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_WRITE_FLASH_PAGE</name>
                  <description>Erase-and-write Flash Page</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_EEPROM</name>
                  <description>Erase EEPROM</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_EEPROM_PAGE</name>
                  <description>Erase EEPROM page</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_EEPROM_BUFFER</name>
                  <description>Load EEPROM page buffer</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_EEPROM_PAGE</name>
                  <description>Write EEPROM page</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_WRITE_EEPROM_PAGE</name>
                  <description>Erase-and-write EEPROM page</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_EEPROM_BUFFER</name>
                  <description>Erase/flush EEPROM page buffer</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APP_CRC</name>
                  <description>Application section CRC</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_CRC</name>
                  <description> Boot Section CRC</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_RANGE_CRC</name>
                  <description>Flash Range CRC</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_ERASE</name>
                  <description>Erase Chip</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_NVM</name>
                  <description>Read NVM</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_FUSE</name>
                  <description>Write Fuse byte</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_BOOT</name>
                  <description>Erase Boot Section</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_CRC</name>
                  <description>Flash CRC</description>
                  <value>120</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDEX</name>
              <description>Command Execute</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control Register B</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMLOCK</name>
              <description>SPM Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPRM</name>
              <description>EEPROM Power Reduction Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPRM</name>
              <description>Flash Power Reduction Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEMAPEN</name>
              <description>EEPROM Mapping Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0</name>
          <description>Data Register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DATA1</name>
          <description>Data Register 1</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DATA2</name>
          <description>Data Register 2</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EELVL</name>
              <description>EEPROM Interrupt Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPMLVL</name>
              <description>SPM Interrupt Level</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
