hammerlink/atdf2svd/tests/data/atxmega128a1.svd
        <register>
          <name>LOCKBITS</name>
          <description>Lock Bits</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LB</name>
              <description>Lock Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLBAT</name>
              <description>Boot Lock Bits - Application Table</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RLOCK</name>
                  <description>Read not allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLBA</name>
              <description>Boot Lock Bits - Application Section</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RLOCK</name>
                  <description>Read not allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLBB</name>
              <description>Boot Lock Bits - Boot Section</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RLOCK</name>
                  <description>Read not allowed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WLOCK</name>
                  <description>Write not allowed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLOAD</name>
              <description>Flash Page Buffer Active Loading</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EELOAD</name>
              <description>EEPROM Page Buffer Active Loading</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FBUSY</name>
              <description>Flash Memory Busy</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NVMBUSY</name>
              <description>Non-volatile Memory Busy</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
