hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCD</name>
      <description>On-Chip Debug System</description>
      <baseAddress>0x0000002E</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCDR0</name>
          <description>OCD Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCDRD</name>
              <description>OCDR Dirty</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDR1</name>
          <description>OCD Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCDRD</name>
              <description>OCDR Dirty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OSC</name>
      <description>Oscillator</description>
      <baseAddress>0x00000050</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RC2MEN</name>
              <description>Internal 2MHz RC Oscillator Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32MEN</name>
              <description>Internal 32MHz RC Oscillator Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32KEN</name>
              <description>Internal 32kHz RC Oscillator Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCEN</name>
              <description>External Oscillator Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLL Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLCTRL</name>
          <description>DFLL Control Register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RC2MCREF</name>
              <description>2MHz Calibration Reference</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32MCREF</name>
              <description>32MHz Calibration Reference</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCTRL</name>
          <description>PLL Control REgister</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLFAC</name>
              <description>Multiplication Factor</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>PLLSRC</name>
              <description>Clock Source</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC2M</name>
                  <description>Internal 2MHz RC Oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC32M</name>
                  <description>Internal 32MHz RC Oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC</name>
                  <description>External Oscillator</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KCAL</name>
          <description>32kHz Internal Oscillator Calibration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RC2MRDY</name>
              <description>Internal 2MHz RC Oscillator Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32MRDY</name>
              <description>Internal 32MHz RC Oscillator Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>Internal 32kHz RC Oscillator Ready</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCRDY</name>
              <description>External Oscillator Ready</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>PLL Ready</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSCCTRL</name>
          <description>External Oscillator Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XOSCSEL</name>
              <description>External Oscillator Selection and Startup Time</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External Clock - 6 CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KHz</name>
                  <description>32kHz TOSC - 32K CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_256CLK</name>
                  <description>0.4-16MHz XTAL - 256 CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_1KCLK</name>
                  <description>0.4-16MHz XTAL - 1K CLK</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_16KCLK</name>
                  <description>0.4-16MHz XTAL - 16K CLK</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>X32KLPM</name>
              <description>32kHz XTAL OSC Low-power Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRQRANGE</name>
              <description>Frequency Range</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>04TO2</name>
                  <description>0.4 - 2 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2TO9</name>
                  <description>2 - 9 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9TO12</name>
                  <description>9 - 12 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12TO16</name>
                  <description>12 - 16 MHz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSCFAIL</name>
          <description>External Oscillator Failure Detection Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XOSCFDEN</name>
              <description>Failure Detection Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSCFDIF</name>
              <description>Failure Detection Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
