hammerlink/atdf2svd/tests/data/atxmega128a1.svd
        <register>
          <name>PIN7CTRL</name>
          <description>Pin 7 Control Register</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense Level (Transparent For Events)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Disable Digital Input Buffer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPC</name>
              <description>Output/Pull Configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTEM</name>
                  <description>Totempole</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSKEEPER</name>
                  <description>Totempole w/ Bus keeper on Input and Output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLDOWN</name>
                  <description>Totempole w/ Pull-down on Input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLUP</name>
                  <description>Totempole w/ Pull-up on Input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired OR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Wired AND</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULL</name>
                  <description>Wired OR w/ Pull-down</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULL</name>
                  <description>Wired AND w/ Pull-up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLEN</name>
              <description>Slew Rate Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTC</name>
      <description>Port Configuration</description>
      <baseAddress>0x00000640</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>I/O Port Data Direction</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIRCLR</name>
          <description>I/O Port Data Direction Clear</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIRSET</name>
          <description>I/O Port Data Direction Set</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIRTGL</name>
          <description>I/O Port Data Direction Toggle</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>IN</name>
          <description>I/O port Input</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INT0MASK</name>
          <description>Port Interrupt 0 Mask</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INT1MASK</name>
          <description>Port Interrupt 1 Mask</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control Register</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0LVL</name>
              <description>Port Interrupt 0 Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low Level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium Level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High Level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT1LVL</name>
              <description>Port Interrupt 1 Level</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low Level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium Level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High Level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0IF</name>
              <description>Port Interrupt 0 Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1IF</name>
              <description>Port Interrupt 1 Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>I/O Port Output</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OUTCLR</name>
          <description>I/O Port Output Clear</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OUTSET</name>
          <description>I/O Port Output Set</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OUTTGL</name>
          <description>I/O Port Output Toggle</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PIN0CTRL</name>
          <description>Pin 0 Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense Level (Transparent For Events)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Disable Digital Input Buffer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPC</name>
              <description>Output/Pull Configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTEM</name>
                  <description>Totempole</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSKEEPER</name>
                  <description>Totempole w/ Bus keeper on Input and Output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLDOWN</name>
                  <description>Totempole w/ Pull-down on Input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLUP</name>
                  <description>Totempole w/ Pull-up on Input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired OR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Wired AND</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULL</name>
                  <description>Wired OR w/ Pull-down</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULL</name>
                  <description>Wired AND w/ Pull-up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLEN</name>
              <description>Slew Rate Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN1CTRL</name>
          <description>Pin 1 Control Register</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense Level (Transparent For Events)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Disable Digital Input Buffer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPC</name>
              <description>Output/Pull Configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTEM</name>
                  <description>Totempole</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSKEEPER</name>
                  <description>Totempole w/ Bus keeper on Input and Output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLDOWN</name>
                  <description>Totempole w/ Pull-down on Input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLUP</name>
                  <description>Totempole w/ Pull-up on Input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired OR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Wired AND</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULL</name>
                  <description>Wired OR w/ Pull-down</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULL</name>
                  <description>Wired AND w/ Pull-up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLEN</name>
              <description>Slew Rate Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
