hammerlink/atdf2svd/tests/data/atxmega128a1.svd
        <register>
          <name>PIN7CTRL</name>
          <description>Pin 7 Control Register</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC</name>
              <description>Input/Sense Configuration</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGES</name>
                  <description>Sense Both Edges</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense Rising Edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense Falling Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>Sense Level (Transparent For Events)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT_DISABLE</name>
                  <description>Disable Digital Input Buffer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPC</name>
              <description>Output/Pull Configuration</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTEM</name>
                  <description>Totempole</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSKEEPER</name>
                  <description>Totempole w/ Bus keeper on Input and Output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLDOWN</name>
                  <description>Totempole w/ Pull-down on Input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULLUP</name>
                  <description>Totempole w/ Pull-up on Input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired OR</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Wired AND</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULL</name>
                  <description>Wired OR w/ Pull-down</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULL</name>
                  <description>Wired AND w/ Pull-up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVEN</name>
              <description>Inverted I/O Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLEN</name>
              <description>Slew Rate Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORT_CFG</name>
      <description>Port Configuration</description>
      <baseAddress>0x000000B0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLKEVOUT</name>
          <description>Clock and Event Out Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKOUT</name>
              <description>Clock Output Port</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Clock Output Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC7</name>
                  <description>Clock Output on Port C pin 7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD7</name>
                  <description>Clock Output on Port D pin 7</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE7</name>
                  <description>Clock Output on Port E pin 7</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOUT</name>
              <description>Event Output Port</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event Output Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC7</name>
                  <description>Event Channel 7 Output on Port C pin 7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD7</name>
                  <description>Event Channel 7 Output on Port D pin 7</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE7</name>
                  <description>Event Channel 7 Output on Port E pin 7</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCMASK</name>
          <description>Multi-pin Configuration Mask</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>VPCTRLA</name>
          <description>Virtual Port Control Register A</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VP0MAP</name>
              <description>Virtual Port 0 Mapping</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Mapped To PORTA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Mapped To PORTB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Mapped To PORTC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Mapped To PORTD</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE</name>
                  <description>Mapped To PORTE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>Mapped To PORTF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTG</name>
                  <description>Mapped To PORTG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTH</name>
                  <description>Mapped To PORTH</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTJ</name>
                  <description>Mapped To PORTJ</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTK</name>
                  <description>Mapped To PORTK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTL</name>
                  <description>Mapped To PORTL</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTM</name>
                  <description>Mapped To PORTM</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTN</name>
                  <description>Mapped To PORTN</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTP</name>
                  <description>Mapped To PORTP</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTQ</name>
                  <description>Mapped To PORTQ</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTR</name>
                  <description>Mapped To PORTR</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VP1MAP</name>
              <description>Virtual Port 1 Mapping</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Mapped To PORTA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Mapped To PORTB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Mapped To PORTC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Mapped To PORTD</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE</name>
                  <description>Mapped To PORTE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>Mapped To PORTF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTG</name>
                  <description>Mapped To PORTG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTH</name>
                  <description>Mapped To PORTH</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTJ</name>
                  <description>Mapped To PORTJ</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTK</name>
                  <description>Mapped To PORTK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTL</name>
                  <description>Mapped To PORTL</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTM</name>
                  <description>Mapped To PORTM</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTN</name>
                  <description>Mapped To PORTN</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTP</name>
                  <description>Mapped To PORTP</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTQ</name>
                  <description>Mapped To PORTQ</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTR</name>
                  <description>Mapped To PORTR</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VPCTRLB</name>
          <description>Virtual Port Control Register B</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VP2MAP</name>
              <description>Virtual Port 2 Mapping</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Mapped To PORTA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Mapped To PORTB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Mapped To PORTC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Mapped To PORTD</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE</name>
                  <description>Mapped To PORTE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>Mapped To PORTF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTG</name>
                  <description>Mapped To PORTG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTH</name>
                  <description>Mapped To PORTH</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTJ</name>
                  <description>Mapped To PORTJ</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTK</name>
                  <description>Mapped To PORTK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTL</name>
                  <description>Mapped To PORTL</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTM</name>
                  <description>Mapped To PORTM</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTN</name>
                  <description>Mapped To PORTN</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTP</name>
                  <description>Mapped To PORTP</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTQ</name>
                  <description>Mapped To PORTQ</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTR</name>
                  <description>Mapped To PORTR</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VP3MAP</name>
              <description>Virtual Port 3 Mapping</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Mapped To PORTA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Mapped To PORTB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Mapped To PORTC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Mapped To PORTD</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTE</name>
                  <description>Mapped To PORTE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF</name>
                  <description>Mapped To PORTF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTG</name>
                  <description>Mapped To PORTG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTH</name>
                  <description>Mapped To PORTH</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTJ</name>
                  <description>Mapped To PORTJ</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTK</name>
                  <description>Mapped To PORTK</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTL</name>
                  <description>Mapped To PORTL</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTM</name>
                  <description>Mapped To PORTM</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTN</name>
                  <description>Mapped To PORTN</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTP</name>
                  <description>Mapped To PORTP</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTQ</name>
                  <description>Mapped To PORTQ</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTR</name>
                  <description>Mapped To PORTR</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
