hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TCD1</name>
      <description>16-bit Timer/Counter With PWM</description>
      <baseAddress>0x00000940</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCA</name>
          <description>Compare or Capture A</description>
          <addressOffset>0x28</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CCABUF</name>
          <description>Compare Or Capture A Buffer</description>
          <addressOffset>0x38</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CCB</name>
          <description>Compare or Capture B</description>
          <addressOffset>0x2A</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CCBBUF</name>
          <description>Compare Or Capture B Buffer</description>
          <addressOffset>0x3A</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CNT</name>
          <description>Count</description>
          <addressOffset>0x20</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control  Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Timer Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>System Clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>System Clock / 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>System Clock / 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>System Clock / 8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>System Clock / 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>System Clock / 256</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>System Clock / 1024</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH0</name>
                  <description>Event Channel 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH1</name>
                  <description>Event Channel 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH2</name>
                  <description>Event Channel 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH3</name>
                  <description>Event Channel 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH4</name>
                  <description>Event Channel 4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH5</name>
                  <description>Event Channel 5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH6</name>
                  <description>Event Channel 6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVCH7</name>
                  <description>Event Channel 7</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGMODE</name>
              <description>Waveform generation mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ</name>
                  <description>Frequency Generation Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS</name>
                  <description>Single Slope</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_T</name>
                  <description>Dual Slope, Update on TOP</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_TB</name>
                  <description>Dual Slope, Update on TOP and BOTTOM</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS_B</name>
                  <description>Dual Slope, Update on BOTTOM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCAEN</name>
              <description>Compare or Capture A Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCBEN</name>
              <description>Compare or Capture B Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLC</name>
          <description>Control register C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMPA</name>
              <description>Compare A Output Value</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPB</name>
              <description>Compare B Output Value</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLD</name>
          <description>Control Register D</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVSEL</name>
              <description>Event Source Select</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>Event Channel 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>Event Channel 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>Event Channel 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>Event Channel 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4</name>
                  <description>Event Channel 4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5</name>
                  <description>Event Channel 5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6</name>
                  <description>Event Channel 6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7</name>
                  <description>Event Channel 7</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVDLY</name>
              <description>Event Delay</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVACT</name>
              <description>Event Action</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No Event Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPT</name>
                  <description>Input Capture</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN</name>
                  <description>Externally Controlled Up/Down Count</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QDEC</name>
                  <description>Quadrature Decode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Restart</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRQ</name>
                  <description>Frequency Capture</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PW</name>
                  <description>Pulse-width Capture</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLE</name>
          <description>Control Register E</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTEM</name>
              <description>Byte Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLFCLR</name>
          <description>Control Register F Clear</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LUPD</name>
              <description>Lock Update</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLFSET</name>
          <description>Control Register F Set</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LUPD</name>
              <description>Lock Update</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Force Update</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Force Restart</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Force Hard Reset</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLGCLR</name>
          <description>Control Register G Clear</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERBV</name>
              <description>Period Buffer Valid</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCABV</name>
              <description>Compare or Capture A Buffer Valid</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCBBV</name>
              <description>Compare or Capture B Buffer Valid</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLGSET</name>
          <description>Control Register G Set</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERBV</name>
              <description>Period Buffer Valid</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCABV</name>
              <description>Compare or Capture A Buffer Valid</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCBBV</name>
              <description>Compare or Capture B Buffer Valid</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRLA</name>
          <description>Interrupt Control Register A</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVFINTLVL</name>
              <description>Overflow interrupt level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low Level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium Level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High Level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRINTLVL</name>
              <description>Error Interrupt Level</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Interrupt Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO</name>
                  <description>Low Level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Medium Level</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI</name>
                  <description>High Level</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
