hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TWIE</name>
      <description>Two-Wire Interface</description>
      <baseAddress>0x000004A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>TWI Common Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EDIEN</name>
              <description>External Driver Interface Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDAHOLD</name>
              <description>SDA Hold Time Enable</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>SDA hold time off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50NS</name>
                  <description>Typical 50ns hold time</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>300NS</name>
                  <description>Typical 300ns hold time</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>400NS</name>
                  <description>Typical 400ns hold time</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>MASTER</name>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Address Register</description>
            <addressOffset>0x5</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>BAUD</name>
            <description>Baud Rate Control Register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>CTRLA</name>
            <description>Control Register A</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable TWI Master</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WIEN</name>
                <description>Write Interrupt Enable</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RIEN</name>
                <description>Read Interrupt Enable</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INTLVL</name>
                <description>Interrupt Level</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low Level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium Level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High Level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLB</name>
            <description>Control Register B</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>SMEN</name>
                <description>Smart Mode Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>QCEN</name>
                <description>Quick Command Enable</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TIMEOUT</name>
                <description>Inactive Bus timeout</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Bus Timeout Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50US</name>
                    <description>50 Microseconds</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100US</name>
                    <description>100 Microseconds</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>200US</name>
                    <description>200 Microseconds</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLC</name>
            <description>Control Register C</description>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CMD</name>
                <description>Command</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOACT</name>
                    <description>No Action</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REPSTART</name>
                    <description>Issue Repeated Start Condition</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RECVTRANS</name>
                    <description>Receive or Transmit Data</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STOP</name>
                    <description>Issue Stop Condition</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACKACT</name>
                <description>Acknowledge Action</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Data Register</description>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status Register</description>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>BUSSTATE</name>
                <description>Bus State</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UNKNOWN</name>
                    <description>Unknown Bus State</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLE</name>
                    <description>Bus is Idle</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OWNER</name>
                    <description>This Module Controls The Bus</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUSY</name>
                    <description>The Bus is Busy</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUSERR</name>
                <description>Bus Error</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ARBLOST</name>
                <description>Arbitration Lost</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RXACK</name>
                <description>Received Acknowledge</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLKHOLD</name>
                <description>Clock Hold</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WIF</name>
                <description>Write Interrupt Flag</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RIF</name>
                <description>Read Interrupt Flag</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SLAVE</name>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Address Register</description>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>ADDRMASK</name>
            <description>Address Mask Register</description>
            <addressOffset>0x5</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>ADDREN</name>
                <description>Address Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDRMASK</name>
                <description>Address Mask</description>
                <bitRange>[7:1]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>127</maximum>
                  </range>
                </writeConstraint>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLA</name>
            <description>Control Register A</description>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>SMEN</name>
                <description>Smart Mode Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PMEN</name>
                <description>Promiscuous Mode Enable</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PIEN</name>
                <description>Stop Interrupt Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable TWI Slave</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>APIEN</name>
                <description>Address/Stop Interrupt Enable</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIEN</name>
                <description>Data Interrupt Enable</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INTLVL</name>
                <description>Interrupt Level</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>Interrupt Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LO</name>
                    <description>Low Level</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MED</name>
                    <description>Medium Level</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HI</name>
                    <description>High Level</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTRLB</name>
            <description>Control Register B</description>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>CMD</name>
                <description>Command</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
                <writeConstraint>
                  <useEnumeratedValues>true</useEnumeratedValues>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOACT</name>
                    <description>No Action</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMPTRANS</name>
                    <description>Used To Complete a Transaction</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESPONSE</name>
                    <description>Used in Response to Address/Data Interrupt</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ACKACT</name>
                <description>Acknowledge Action</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Data Register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <writeConstraint>
              <range>
                <minimum>0</minimum>
                <maximum>255</maximum>
              </range>
            </writeConstraint>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status Register</description>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>AP</name>
                <description>Slave Address or Stop</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIR</name>
                <description>Read/Write Direction</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUSERR</name>
                <description>Bus Error</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COLL</name>
                <description>Collision</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RXACK</name>
                <description>Received Acknowledge</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLKHOLD</name>
                <description>Clock Hold</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>APIF</name>
                <description>Address/Stop Interrupt Flag</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIF</name>
                <description>Data Interrupt Flag</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
