hammerlink/atdf2svd/tests/data/atxmega128a1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VPORT3</name>
      <description>Port Configuration</description>
      <baseAddress>0x0000001C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR</name>
          <description>I/O Port Data Direction</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>IN</name>
          <description>I/O Port Input</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT0IF</name>
              <description>Port Interrupt 0 Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1IF</name>
              <description>Port Interrupt 1 Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>I/O Port Output</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watch-Dog Timer</description>
      <baseAddress>0x00000080</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CEN</name>
              <description>Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PER</name>
              <description>Period</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms @ 3.3V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms @ 3.3V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms @ 3.3V)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms @ 3.3V)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s @ 3.3V)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s @ 3.3V)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s @ 3.3V)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1s @ 3.3V)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2s @ 3.3V)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4s @ 3.3V)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8s @ 3.3V)</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Syncronization busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WINCTRL</name>
          <description>Windowed Mode Control</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WCEN</name>
              <description>Windowed Mode Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WEN</name>
              <description>Windowed Mode Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WPER</name>
              <description>Windowed Mode Period</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms @ 3.3V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms @ 3.3V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms @ 3.3V)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms @ 3.3V)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s @ 3.3V)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s @ 3.3V)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s @ 3.3V)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1s @ 3.3V)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2s @ 3.3V)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4s @ 3.3V)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8s @ 3.3V)</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>